---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTextAppearance
source: html/70d4fd18-cfe6-28ff-8fc1-5aa6af5b8d6e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedTextAppearance Property

"Text Appearance"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewGraphSchedTextAppearance { get; }
```